<!doctype>
<html lang="ja">
<head>
    @include('common.meta')
    @yield('meta')
<!--
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字　　字字字字字字字字　字字字字字字字字字字字字字字字
字字字字字字字字字字字字字　　　字字字字字字字字　　字字字字字字字字字字字字字字
字字字字字字字字字字字字字　　　字字字字字字字字　　サ字字字字字字字字字字字字字
字字字字字字字字字字字字字字　　　　　　　　　　　字字字字字字字字字字字字字字字
字字字字字字字字字字　　　　　　　　　　　　　　　　　　　字字字字字字字字字字字
字字字字字字字字字　　　　　　　　　　　　　　　　　　　　　　字字字字字字字字字
字字字字字字字　　　　　　　　　　　　　　　　　　　　　　　　　ル字字字字字字字
字字字字字字　　　　　　　　　　　　　　　　　　　　　　　　　　　　字字字字字字
字字字字字字　　　　　　　　　　　　　　　　　　　　　　　　　　　　字字字字字字
字字字字字字字　　　　　　　　　　　　　　　　　　　　　　　　　　字字字字字字字
字字字字字字字　　　　　　　　　　　　　　　　　　　　　　　　　　字字字字字字字
字字字字字字字　　　　　　　　　　　　　　　　　　　　　　　　　字字字字字字字字
字字字字字字字字　　　　　　　　　　　　　　　　　　　　　　　　字字字字字字字字
字字字字字字字字　　　　　　　　　　　　　　　　　　　　　　　　字字字字字字字字
字字字字字字字字　　　　　　　　　　　　　　　　　　　　　　　　字字字字字字字字
字字字字字字字字　　　　　　　　　　　　　　　　　　　　　　　字字字字字字字字字
字字字字字字字字字　　　　　　　　　　　　　　　　　　　　　　字字字字字字字字字
字字字字字字字字字ル　　　　　　　　　　　　　　　　　　　　字字字字字字字字字字
字字字字字字字字字字　　　　　　　　　　　　　　　　　　　プ字字字字字字字字字字
字字字字字字字字字字字　　　　　　　　　　　　　　　　　　字字字字字字字字字字字
字字字字字字字字字字字字　　　　　　　　　　　　　　　　字字字字字字字字字字字字
字字字字字字字字字字字字字字　　　　　　　　　　　　字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字　　　　　　　　字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字　　字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字　　字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字　　字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字　　字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字　　字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字　　字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字
字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字字

                        we are team A+plus.
                     why don't you join us ??
                  https://twitter.com/waseda_Aplus

-->
    @yield('css')
    <title>
        @yield('title')
    </title>
</head>
<body>
    @include('common.header')
    @yield('main_content')
    @include('common.footer')

<script type="text/javascript" src="{{ asset('/js/alertify.js') }}"></script>
  @yield('js')
</body>
</html>