-- phpMyAdmin SQL Dump
-- version 4.2.2
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: May 26, 2015 at 07:00 AM
-- Server version: 5.6.19
-- PHP Version: 5.5.24

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `waseda_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE IF NOT EXISTS `migrations` (
  `migration` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`migration`, `batch`) VALUES
('2014_10_12_000000_create_users_table', 1),
('2014_10_12_100000_create_password_resets_table', 1),
('2015_05_19_002022_create_classes_table', 2),
('2015_05_20_014116_create_reviews_table', 2),
('2015_05_24_175529_create_queries_table', 3),
('2015_05_26_144347_create_session_table', 4);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE IF NOT EXISTS `password_resets` (
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `queries`
--

CREATE TABLE IF NOT EXISTS `queries` (
`id` int(10) unsigned NOT NULL,
  `word` varchar(128) COLLATE utf8_unicode_ci NOT NULL COMMENT '検索ワード',
  `count` int(11) NOT NULL DEFAULT '1' COMMENT 'ワードカウント',
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=18 ;

--
-- Dumping data for table `queries`
--

INSERT INTO `queries` (`id`, `word`, `count`, `created_at`, `updated_at`) VALUES
(1, 'データリテラシー', 2, '2015-05-26 05:02:43', '2015-05-26 05:27:41'),
(3, 'リテラシー', 5, '2015-05-26 05:04:24', '2015-05-26 05:44:29'),
(4, 'データ', 4, '2015-05-26 05:28:19', '2015-05-26 05:44:29'),
(7, '情報', 1, '2015-05-26 05:53:24', '2015-05-26 05:53:24'),
(10, 'aaa', 1, '2015-05-26 06:04:00', '2015-05-26 06:04:00'),
(11, '<', 1, '2015-05-26 06:04:04', '2015-05-26 06:04:04'),
(12, '<html>', 1, '2015-05-26 06:04:09', '2015-05-26 06:04:09'),
(13, '<html', 1, '2015-05-26 06:04:18', '2015-05-26 06:04:18'),
(14, '<b', 1, '2015-05-26 06:05:02', '2015-05-26 06:05:02'),
(15, '<strong', 1, '2015-05-26 06:05:07', '2015-05-26 06:05:07'),
(16, '<strong>', 1, '2015-05-26 06:05:11', '2015-05-26 06:05:11'),
(17, '&lt;strong&gt;', 2, '2015-05-26 06:13:10', '2015-05-26 06:13:12');

-- --------------------------------------------------------

--
-- Table structure for table `sessions`
--

CREATE TABLE IF NOT EXISTS `sessions` (
  `id` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `payload` text COLLATE utf8_unicode_ci NOT NULL,
  `last_activity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `sessions`
--

INSERT INTO `sessions` (`id`, `payload`, `last_activity`) VALUES
('16f81f010faf85274b5e420a6c7d2f4a3e822978', 'YTo1OntzOjY6Il90b2tlbiI7czo0MDoic2c5S1lFZmo1YXhaRjBiVUE1Y0ZGNTdQRkFodlpoaHdUM1lhYnlZNiI7czoxNDoic2VhcmNoX3Nlc3Npb24iO2E6NTp7czoxOiJxIjtzOjA6IiI7czozOiJkYXkiO3M6MToiMCI7czo2OiJwZXJpb2QiO3M6MToiMCI7czo0OiJ0ZXJtIjtzOjE6IjIiO3M6NjoiX3Rva2VuIjtzOjQwOiJzZzlLWUVmajVheFpGMGJVQTVjRkY1N1BGQWh2Wmhod1QzWWFieVk2Ijt9czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6OTc6Imh0dHA6Ly93amlua2EuY29tL3NlYXJjaD9fdG9rZW49c2c5S1lFZmo1YXhaRjBiVUE1Y0ZGNTdQRkFodlpoaHdUM1lhYnlZNiZkYXk9MCZwZXJpb2Q9MCZxPSZ0ZXJtPTIiO31zOjU6ImZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fXM6OToiX3NmMl9tZXRhIjthOjM6e3M6MToidSI7aToxNDMyNjIzMTYyO3M6MToiYyI7aToxNDMyNjE5MDUyO3M6MToibCI7czoxOiIwIjt9fQ==', 1432623162);

-- --------------------------------------------------------

--
-- Table structure for table `tm_classes`
--

CREATE TABLE IF NOT EXISTS `tm_classes` (
`id` int(20) NOT NULL COMMENT '授業ID',
  `class_code` varchar(100) NOT NULL,
  `class_name` varchar(2000) NOT NULL COMMENT '授業名',
  `teacher` varchar(255) NOT NULL COMMENT '教師名',
  `class_week` varchar(500) NOT NULL COMMENT '授業曜日',
  `class_period` varchar(100) NOT NULL COMMENT '授業時限',
  `class_no` varchar(100) NOT NULL COMMENT '授業No.(あれば)',
  `zemi` char(1) NOT NULL,
  `second_regi` char(1) NOT NULL,
  `term` int(1) NOT NULL DEFAULT '0' COMMENT '学期(0:春学期/1:秋学期)'
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=385 ;

--
-- Dumping data for table `tm_classes`
--

INSERT INTO `tm_classes` (`id`, `class_code`, `class_name`, `teacher`, `class_week`, `class_period`, `class_no`, `zemi`, `second_regi`, `term`) VALUES
(4, '1930000001', 'スタディスキル 01', '', '月', '4', '01', 'n', 'n', 0),
(5, '1930000001', 'スタディスキル 02', '', '火', '4', '02', 'n', 'n', 0),
(6, '1930000001', 'スタディスキル 03', '', '木', '4', '03', 'n', 'n', 0),
(7, '1930000001', 'スタディスキル 04', '', '金', '4', '04', 'n', 'n', 0),
(8, '1930000001', 'スタディスキル 05', '', '月', '4', '05', 'n', 'n', 0),
(9, '1930000001', 'スタディスキル 06', '', '火', '4', '06', 'n', 'n', 0),
(10, '1930000001', 'スタディスキル 07', '', '火', '4', '07', 'n', 'n', 0),
(11, '1930000001', 'スタディスキル 08', '', '木', '4', '08', 'n', 'n', 0),
(12, '1930000001', 'スタディスキル 09', '', '木', '4', '09', 'n', 'n', 0),
(13, '1930000001', 'スタディスキル 10', '', '金', '4', '10', 'n', 'n', 0),
(14, '1930000001', 'スタディスキル 11', '', '夏季', '00', '11', 'n', 'n', 0),
(15, '1930000010', '学生生活とセルフマネジメント 01', '', '月', '4', '01', 'n', 'n', 0),
(16, '1930000010', '学生生活とセルフマネジメント 02', '', '火', '4', '02', 'n', 'n', 0),
(17, '1930000010', '学生生活とセルフマネジメント 03', '', '木', '4', '03', 'n', 'n', 0),
(18, '1930000010', '学生生活とセルフマネジメント 04', '', '金', '4', '04', 'n', 'n', 0),
(19, '1930000010', '学生生活とセルフマネジメント 05', '', '月', '4', '05', 'n', 'n', 0),
(20, '1930000010', '学生生活とセルフマネジメント 06', '', '火', '4', '06', 'n', 'n', 0),
(21, '1930000010', '学生生活とセルフマネジメント 07', '', '火', '4', '07', 'n', 'n', 0),
(22, '1930000010', '学生生活とセルフマネジメント 08', '', '木', '4', '08', 'n', 'n', 0),
(23, '1930000010', '学生生活とセルフマネジメント 09', '', '木', '4', '09', 'n', 'n', 0),
(24, '1930000010', '学生生活とセルフマネジメント 10', '', '金', '4', '10', 'n', 'n', 0),
(25, '1930000010', '学生生活とセルフマネジメント 11', '', '夏季', '00', '11', 'n', 'n', 0),
(26, '1930000020', '基礎ゼミ 01', '', '月', '6', '01', 'n', 'y', 0),
(27, '1930000020', '基礎ゼミ 02', '', '月', '6', '02', 'n', 'y', 0),
(28, '1930000020', '基礎ゼミ 03', '', '月', '6', '03', 'n', 'y', 0),
(29, '1930000020', '基礎ゼミ 04', '', '月', '6', '04', 'n', 'n', 0),
(30, '1930000020', '基礎ゼミ 05', '', '火', '6', '05', 'n', 'n', 0),
(31, '1930000020', '基礎ゼミ 06', '', '火', '6', '06', 'n', 'n', 0),
(32, '1930000020', '基礎ゼミ 07', '', '火', '6', '07', 'n', 'n', 0),
(33, '1930000020', '基礎ゼミ 08', '', '火', '6', '08', 'n', 'y', 0),
(34, '1930000020', '基礎ゼミ 09', '', '火', '6', '09', 'n', 'y', 0),
(35, '1930000020', '基礎ゼミ 10', '', '火', '6', '10', 'n', 'y', 0),
(36, '1930000020', '基礎ゼミ 11', '', '木', '6', '11', 'n', 'y', 0),
(37, '1930000020', '基礎ゼミ 12', '', '木', '6', '12', 'n', 'y', 0),
(38, '1930000020', '基礎ゼミ 13', '', '木', '6', '13', 'n', 'y', 0),
(39, '1930000020', '基礎ゼミ 14', '', '木', '6', '14', 'n', 'y', 0),
(40, '1930000020', '基礎ゼミ 15', '', '木', '6', '15', 'n', 'y', 0),
(41, '1930000020', '基礎ゼミ 16', '', '木', '6', '16', 'n', 'y', 0),
(42, '1930000020', '基礎ゼミ 17', '', '金', '6', '17', 'n', 'n', 0),
(43, '1930000020', '基礎ゼミ 18', '', '金', '6', '18', 'n', 'n', 0),
(44, '1930000020', '基礎ゼミ 19', '', '金', '6', '19', 'n', 'n', 0),
(45, '1930000020', '基礎ゼミ 20', '', '金', '6', '20', 'n', 'n', 0),
(46, '1930000040', '人間環境科学概論', '', '月', '5', '01', 'n', 'y', 0),
(47, '1930000050', '健康福祉科学概論', '', '金', '5', '01', 'n', 'y', 0),
(48, '1930000060', '人間情報科学概論', '', '金', '5', '01', 'n', 'y', 0),
(49, '1930000070', '人間科学のための線形代数・解析', '', '月', '5', '01', 'n', 'y', 0),
(50, '1930000100', '人間科学のための生命科学', '', '月', '3', '01', 'n', 'y', 0),
(51, '1930000210', 'データリテラシー1 01', '', '月', '5', '01', 'n', 'n', 0),
(52, '1930000210', 'データリテラシー1 02', '', '火', '5', '02', 'n', 'n', 0),
(53, '1930000210', 'データリテラシー1 03', '', '木', '5', '03', 'n', 'n', 0),
(54, '1930000210', 'データリテラシー1 04', '', '金', '5', '04', 'n', 'n', 0),
(55, '1930000210', 'データリテラシー1 05', '', '月', '5', '05', 'n', 'n', 0),
(56, '1930000210', 'データリテラシー1 06', '', '火', '5', '06', 'n', 'n', 0),
(57, '1930000210', 'データリテラシー1 07', '', '火', '5', '07', 'n', 'n', 0),
(58, '1930000210', 'データリテラシー1 08', '', '木', '5', '08', 'n', 'n', 0),
(59, '1930000210', 'データリテラシー1 09', '', '木', '5', '09', 'n', 'n', 0),
(60, '1930000210', 'データリテラシー1 10', '', '金', '5', '10', 'n', 'n', 0),
(61, '1930000210', 'データリテラシー1 11', '', '夏季', '00', '11', 'n', 'n', 0),
(62, '1930000210', 'データリテラシー1 12', '', '月', '2', '12', 'n', 'n', 0),
(63, '1930000220', 'データリテラシー2 11', '', '木', '2', '11', 'n', 'n', 0),
(64, '1930000230', 'データリテラシー3 01', '', '月', '6', '01', 'n', 'n', 0),
(65, '1930000230', 'データリテラシー3 02', '', '火', '6', '02', 'n', 'n', 0),
(66, '1930000230', 'データリテラシー3 03', '', '木', '6', '03', 'n', 'n', 0),
(67, '1930000230', 'データリテラシー3 04', '', '金', '6', '04', 'n', 'n', 0),
(68, '1930000230', 'データリテラシー3 05', '', '月', '6', '05', 'n', 'n', 0),
(69, '1930000230', 'データリテラシー3 06', '', '火', '6', '06', 'n', 'n', 0),
(70, '1930000230', 'データリテラシー3 07', '', '火', '6', '07', 'n', 'n', 0),
(71, '1930000230', 'データリテラシー3 08', '', '木', '6', '08', 'n', 'n', 0),
(72, '1930000230', 'データリテラシー3 09', '', '木', '6', '09', 'n', 'n', 0),
(73, '1930000230', 'データリテラシー3 10', '', '金', '6', '10', 'n', 'n', 0),
(74, '1930000240', '実験計画法', '', '金', '1', '01', 'n', 'y', 0),
(75, '1930000250', '多変量解析 01', '', '金', '2', '01', 'n', 'n', 0),
(76, '1930000250', '多変量解析 02', '', '夏季', '00', '02', 'n', 'y', 0),
(77, '1930001010', 'Current Topics1 01', '', '木', '3', '01', 'n', 'y', 0),
(78, '1930001010', 'Current Topics1 02', '', '木', '4', '02', 'n', 'y', 0),
(79, '1930001010', 'Current Topics1 03', '', '月', '4', '03', 'n', 'n', 0),
(80, '1930001010', 'Current Topics1 04', '', '月', '5', '04', 'n', 'y', 0),
(81, '1930001010', 'Current Topics1 05', '', '水', '2', '05', 'n', 'n', 0),
(82, '1930001010', 'Current Topics1 06', '', '水', '3', '06', 'n', 'n', 0),
(83, '1930001010', 'Current Topics1 07', '', '木', '1', '07', 'n', 'y', 0),
(84, '1930001010', 'Current Topics1 08', '', '木', '2', '08', 'n', 'n', 0),
(85, '1930001010', 'Current Topics1 09', '', '水', '2', '09', 'n', 'y', 0),
(86, '1930001010', 'Current Topics1 10', '', '水', '3', '10', 'n', 'y', 0),
(87, '1930001010', 'Current Topics1 11', '', '水', '2', '11', 'n', 'y', 0),
(88, '1930001010', 'Current Topics1 12', '', '水', '3', '12', 'n', 'y', 0),
(89, '1930001010', 'Current Topics1 13', '', '金', '3', '13', 'n', 'y', 0),
(90, '1930001010', 'Current Topics1 14', '', '金', '4', '14', 'n', 'y', 0),
(91, '1930001010', 'Current Topics1 15', '', '金', '2', '15', 'n', 'y', 0),
(92, '1930001010', 'Current Topics1 16', '', '金', '3', '16', 'n', 'y', 0),
(93, '1930001010', 'Current Topics1 17', '', '金', '3', '17', 'n', 'y', 0),
(94, '1930001010', 'Current Topics1 18', '', '金', '4', '18', 'n', 'n', 0),
(95, '1930001010', 'Current Topics1 19', '', '水', '2', '19', 'n', 'y', 0),
(96, '1930001010', 'Current Topics1 20', '', '金', '2', '20', 'n', 'y', 0),
(97, '1930001150', 'Academic Reading 中級 02', '', '金', '3', '02', 'n', 'y', 0),
(98, '1930001150', 'Academic Reading 中級 03', '', '火', '1', '03', 'n', 'y', 0),
(99, '1930001150', 'Academic Reading 中級 04', '', '火', '2', '04', 'n', 'y', 0),
(100, '1930001150', 'Academic Reading 中級 05', '', '水', '1', '05', 'n', 'y', 0),
(101, '1930001150', 'Academic Reading 中級 06', '', '水', '2', '06', 'n', 'y', 0),
(102, '1930001150', 'Academic Reading 中級 07', '', '水', '2', '06', 'n', 'n', 0),
(103, '1930001152', 'Academic Reading 上級 01', '', '火', '2', '01', 'n', 'n', 0),
(104, '1930001155', 'Academic Writing 中級 01', '', '金', '3', '01', 'n', 'n', 0),
(105, '1930001155', 'Academic Writing 中級 02', '', '水', '1', '02', 'n', 'y', 0),
(106, '1930001155', 'Academic Writing 中級 05', '', '火', '3', '05', 'n', 'n', 0),
(107, '1930001157', 'Academic Writing 上級 01', '', '火', '1', '01', 'n', 'n', 0),
(108, '1930001160', 'Oral Presentation 中級 01', '', '火', '3', '01', 'n', 'y', 0),
(109, '1930001160', 'Oral Presentation 中級 02', '', '火', '1', '02', 'n', 'y', 0),
(110, '1930001160', 'Oral Presentation 中級 03', '', '火', '2', '03', 'n', 'y', 0),
(111, '1930001165', 'Oral Presentation 上級 01', '', '火', '2', '01', 'n', 'y', 0),
(113, '1930001170', 'Academic Listening 中級 01', '', '火', '4', '01', 'n', 'n', 0),
(114, '1930001170', 'Academic Listening 中級 02', '', '火', '5', '02', 'n', 'n', 0),
(115, '1930001170', 'Academic Listening 中級 03', '', '木', '3', '03', 'n', 'y', 0),
(116, '1930001170', 'Academic Listening 中級 04', '', '木', '4', '04', 'n', 'n', 0),
(117, '1930001175', 'Academic Listening 上級 01', '', '火', '4', '01', 'n', 'n', 0),
(118, '1930002010', 'ドイツ語基礎 1 01', '', '月', '2', '01', 'n', 'y', 0),
(119, '1930002010', 'ドイツ語基礎 1 02', '', '月', '3', '02', 'n', 'y', 0),
(120, '1930002010', 'ドイツ語基礎 1 03', '', '木', '4', '03', 'n', 'y', 0),
(121, '1930002010', 'ドイツ語基礎 1 04', '', '火', '2', '04', 'n', 'y', 0),
(122, '1930002010', 'ドイツ語基礎 1 05', '', '金', '1', '05', 'n', 'y', 0),
(123, '1930002010', 'ドイツ語基礎 1 06', '', '火', '4', '06', 'n', 'y', 0),
(124, '1930002030', 'ドイツ語会話入門 1 01', '', '木', '3', '01', 'n', 'y', 0),
(125, '1930002030', 'ドイツ語会話入門 1 02', '', '木', '4', '02', 'n', 'y', 0),
(126, '1930002030', 'ドイツ語会話入門 1 03', '', '月', '2', '03', 'n', 'y', 0),
(127, '1930002030', 'ドイツ語会話入門 1 04', '', '金', '2', '04', 'n', 'y', 0),
(128, '1930002030', 'ドイツ語会話入門 1 05', '', '水', '1', '05', 'n', 'y', 0),
(129, '1930002030', 'ドイツ語会話入門 1 06', '', '水', '2', '06', 'n', 'y', 0),
(130, '1930002050', 'ドイツ語圏の社会と言語1 01', '', '水', '2', '01', 'n', 'y', 0),
(131, '1930002070', 'ドイツ語コミュニケーション 1 01', '', '金', '3', '01', 'n', 'y', 0),
(132, '1930002070', 'ドイツ語コミュニケーション 1 02', '', '月', '3', '02', 'n', 'y', 0),
(133, '1930002090', 'ドイツ語圏社会文化論A 01', '', '水', '3', '01', 'n', 'y', 0),
(134, '1930002210', 'フランス語基礎 1 01', '', '金', '2', '01', 'n', 'y', 0),
(135, '1930002210', 'フランス語基礎 1 02', '', '金', '1', '02', 'n', 'y', 0),
(136, '1930002210', 'フランス語基礎 1 03', '', '火', '3', '03', 'n', 'y', 0),
(137, '1930002210', 'フランス語基礎 1 04', '', '月', '2', '04', 'n', 'y', 0),
(138, '1930002210', 'フランス語基礎 1 05', '', '月', '3', '05', 'n', 'y', 0),
(139, '1930002210', 'フランス語基礎 1 06', '', '水', '2', '06', 'n', 'y', 0),
(140, '1930002230', 'フランス語会話入門 1 01', '', '水', '1', '01', 'n', 'y', 0),
(141, '1930002230', 'フランス語会話入門 1 02', '', '水', '3', '02', 'n', 'y', 0),
(142, '1930002230', 'フランス語会話入門 1 03', '', '水', '2', '03', 'n', 'y', 0),
(143, '1930002230', 'フランス語会話入門 1 04', '', '木', '2', '04', 'n', 'y', 0),
(144, '1930002230', 'フランス語会話入門 1 05', '', '木', '1', '05', 'n', 'y', 0),
(145, '1930002230', 'フランス語会話入門 1 06', '', '金', '4', '06', 'n', 'y', 0),
(146, '1930002250', 'フランス語圏の社会と言語 1 01', '', '月', '4', '01', 'n', 'y', 0),
(147, '1930002250', 'フランス語圏の社会と言語 1 02', '', '水', '3', '02', 'n', 'y', 0),
(148, '1930002270', 'フランス語コミュニケーション1 01', '', '水', '4', '01', 'n', 'y', 0),
(149, '1930002270', 'フランス語コミュニケーション1 02', '', '金', '5', '02', 'n', 'y', 0),
(150, '1930002270', 'フランス語コミュニケーション1 03', '', '金', '3', '03', 'n', 'y', 0),
(151, '1930002290', 'フランス語圏社会文化論A 01', '', '金', '3', '01', 'n', 'y', 0),
(152, '1930002310', '中国語基礎 1 01', '', '月', '2', '01', 'n', 'y', 0),
(153, '1930002310', '中国語基礎 1 02', '', '月', '3', '02', 'n', 'y', 0),
(154, '1930002310', '中国語基礎 1 03', '', '木', '3', '03', 'n', 'y', 0),
(155, '1930002310', '中国語基礎 1 04', '', '火', '2', '04', 'n', 'y', 0),
(156, '1930002310', '中国語基礎 1 05', '', '火', '4', '05', 'n', 'y', 0),
(157, '1930002310', '中国語基礎 1 06', '', '火', '2', '06', 'n', 'y', 0),
(158, '1930002310', '中国語基礎 1 07', '', '火', '3', '07', 'n', 'y', 0),
(159, '1930002310', '中国語基礎 1 08', '', '火', '3', '08', 'n', 'y', 0),
(160, '1930002310', '中国語基礎 1 09', '', '火', '4', '09', 'n', 'y', 0),
(161, '1930002310', '中国語基礎 1 10', '', '金', '4', '10', 'n', 'y', 0),
(162, '1930002310', '中国語基礎 1 11', '', '金', '5', '11', 'n', 'y', 0),
(163, '1930002310', '中国語基礎 1 12', '', '水', '2', '12', 'n', 'y', 0),
(164, '1930002310', '中国語基礎 1 13', '', '水', '3', '13', 'n', 'y', 0),
(165, '1930002310', '中国語基礎 1 14', '', '水', '4', '14', 'n', 'y', 0),
(166, '1930002330', '中国語会話入門 1 01', '', '火', '3', '01', 'n', 'y', 0),
(167, '1930002330', '中国語会話入門 1 02', '', '火', '4', '02', 'n', 'y', 0),
(168, '1930002330', '中国語会話入門 1 03', '', '火', '3', '03', 'n', 'y', 0),
(169, '1930002330', '中国語会話入門 1 04', '', '木', '2', '04', 'n', 'y', 0),
(170, '1930002330', '中国語会話入門 1 05', '', '木', '3', '05', 'n', 'y', 0),
(171, '1930002330', '中国語会話入門 1 06', '', '木', '1', '06', 'n', 'y', 0),
(172, '1930002330', '中国語会話入門 1 07', '', '木', '3', '07', 'n', 'y', 0),
(173, '1930002330', '中国語会話入門 1 08', '', '水', '4', '08', 'n', 'y', 0),
(174, '1930002330', '中国語会話入門 1 09', '', '水', '5', '09', 'n', 'y', 0),
(175, '1930002330', '中国語会話入門 1 10', '', '水', '3', '10', 'n', 'y', 0),
(176, '1930002330', '中国語会話入門 1 11', '', '水', '4', '11', 'n', 'y', 0),
(177, '1930002330', '中国語会話入門 1 12', '', '火', '4', '12', 'n', 'y', 0),
(178, '1930002330', '中国語会話入門 1 13', '', '火', '1', '13', 'n', 'y', 0),
(179, '1930002330', '中国語会話入門 1 14', '', '火', '2', '14', 'n', 'y', 0),
(180, '1930002350', '中国語圏の社会と言語 1 01', '', '月', '4', '01', 'n', 'y', 0),
(181, '1930002350', '中国語圏の社会と言語 1 02', '', '火', '3', '02', 'n', 'y', 0),
(182, '1930002350', '中国語圏の社会と言語 1 03', '', '金', '3', '03', 'n', 'y', 0),
(183, '1930002370', '中国語コミュニケーション 1 01', '', '火', '2', '01', 'n', 'y', 0),
(184, '1930002370', '中国語コミュニケーション 1 02', '', '木', '2', '02', 'n', 'y', 0),
(185, '1930002370', '中国語コミュニケーション 1 03', '', '水', '3', '03', 'n', 'y', 0),
(186, '1930002370', '中国語コミュニケーション 1 04', '', '木', '4', '04', 'n', 'y', 0),
(187, '1930002390', '中国語圏社会文化論A 01', '', '火', '4', '01', 'n', 'y', 0),
(188, '1930002410', 'スペイン語基礎 1 01', '', '火', '3', '01', 'n', 'y', 0),
(189, '1930002410', 'スペイン語基礎 1 02', '', '火', '3', '02', 'n', 'y', 0),
(190, '1930002410', 'スペイン語基礎 1 03', '', '水', '3', '03', 'n', 'y', 0),
(191, '1930002410', 'スペイン語基礎 1 04', '', '水', '4', '04', 'n', 'y', 0),
(192, '1930002410', 'スペイン語基礎 1 05', '', '金', '1', '05', 'n', 'y', 0),
(193, '1930002410', 'スペイン語基礎 1 06', '', '金', '2', '06', 'n', 'y', 0),
(194, '1930002410', 'スペイン語基礎 1 07', '', '金', '3', '07', 'n', 'n', 0),
(195, '1930002410', 'スペイン語基礎 1 08', '', '金', '2', '08', 'n', 'y', 0),
(196, '1930002430', 'スペイン語会話入門 1 01', '', '木', '2', '01', 'n', 'y', 0),
(197, '1930002430', 'スペイン語会話入門 1 02', '', '木', '1', '02', 'n', 'y', 0),
(198, '1930002430', 'スペイン語会話入門 1 03', '', '金', '3', '03', 'n', 'y', 0),
(199, '1930002430', 'スペイン語会話入門 1 04', '', '金', '2', '04', 'n', 'y', 0),
(200, '1930002430', 'スペイン語会話入門 1 05', '', '水', '2', '05', 'n', 'y', 0),
(201, '1930002430', 'スペイン語会話入門 1 06', '', '月', '3', '06', 'n', 'y', 0),
(202, '1930002430', 'スペイン語会話入門 1 07', '', '月', '2', '07', 'n', 'y', 0),
(203, '1930002430', 'スペイン語会話入門 1 08', '', '水', '1', '08', 'n', 'y', 0),
(204, '1930002450', 'スペイン語圏の社会と言語 1 01', '', '金', '3', '01', 'n', 'y', 0),
(205, '1930002470', 'スペイン語コミュニケーション 1 01', '', '月', '4', '01', 'n', 'n', 0),
(206, '1930002470', 'スペイン語コミュニケーション 1 02', '', '火', '4', '02', 'n', 'y', 0),
(207, '1930002470', 'スペイン語コミュニケーション 1 03', '', '金', '4', '03', 'n', 'y', 0),
(208, '1930002490', 'スペイン語圏社会文化論A 01', '', '金', '2', '01', 'n', 'y', 0),
(209, '1930003A05', '脳の人間科学', '', '木', '2', '01', 'n', 'y', 0),
(210, '1930003A10', '自然人類学', '', '夏季', '00', '01', 'n', 'y', 0),
(211, '1930003A15', '哲学', '', '月', '2', '01', 'n', 'y', 0),
(212, '1930003A30', '老年学', '', '水', '3', '01', 'n', 'n', 0),
(213, '1930003A35', '宗教学', '', '夏季', '00', '01', 'n', 'y', 0),
(214, '1930003A40', '芸術論', '', '月', '5', '01', 'n', 'y', 0),
(215, '1930003B10', '医学と医療の歴史', '', '木', '3', '01', 'n', 'n', 0),
(216, '1930003C10', '現代の生命科学', '', '月', '2', '01', 'n', 'y', 0),
(217, '1930003C15', '現代の地球科学', '', '木', '2', '01', 'n', 'y', 0),
(218, '1930003D01', '言語学', '', '木', '4', '01', 'n', 'y', 0),
(219, '1930003D10', '文学', '', '火', '1', '01', 'n', 'y', 0),
(220, '1930003E01', 'システム論', '', '夏季', '00', '01', 'n', 'y', 0),
(221, '1930003E05', 'エネルギーとエントロピー', '', '水', '2', '01', 'n', 'y', 0),
(222, '1930003E15', 'グローバリゼーション論', '', '水', '2', '01', 'n', 'n', 0),
(223, '1930003F01', 'デザイン論', '', '夏季', '00', '01', 'n', 'n', 0),
(224, '1930003F05', 'ものづくりの技術論', '', '夏季', '00', '01', 'n', 'y', 0),
(225, '1930003G05', 'バイオエシックス', '', '火', '2', '01', 'n', 'y', 0),
(226, '1930003S01', '体育実技A', '', '火', '4', '01', 'n', 'n', 0),
(227, '1930003S02', '体育実技B', '', '木', '2', '01', 'n', 'n', 0),
(228, '1930003S03', '体育実技C', '', '水', '4', '01', 'n', 'n', 0),
(229, '1930003S04', '体育実技D', '', '月', '1', '01', 'n', 'n', 0),
(230, '1930004400', '流域環境管理実習 01 （3,4限連続）', '', '金', '3', '01', 'n', 'y', 0),
(231, '1930004410', '環境変遷史実習  （3,4限連続）', '', '火', '3', '01', 'n', 'y', 0),
(232, '1930004420', '大気環境観測実習（3,4限連続）', '', '火', '3', '01', 'n', 'y', 0),
(233, '1930004430', '森林科学野外実習', '', '夏季', '00', '01', 'n', 'y', 0),
(234, '1930004460', 'アンケート調査法  01', '', '金', '3', '01', 'n', 'n', 0),
(235, '1930004460', 'アンケート調査法 03', '', '金', '4', '03', 'n', 'y', 0),
(236, '1930004460', 'アンケート調査法 04', '', '月', '3', '04', 'n', 'n', 0),
(237, '1930004470', 'インタビュー調査法 01', '', '木', '3', '01', 'n', 'n', 0),
(238, '1930004480', '社会調査法 01', '', '金', '2', '01', 'n', 'n', 0),
(239, '1930004520', '参与観察法 01', '', '火', '3', '01', 'n', 'y', 0),
(240, '1930004520', '参与観察法 02', '', '金', '4', '02', 'n', 'n', 0),
(241, '1930004530', '思想文化研究法 01', '', '金', '3', '01', 'n', 'y', 0),
(242, '1930004540', '環境心理測定法 01 （前半のみ3,4限連続）', '', '木', '3', '01', 'n', 'n', 0),
(243, '1930004540', '環境心理測定法 02 （前半のみ3,4限連続）', '', '木', '3', '02', 'n', 'y', 0),
(244, '1930004550', '行動観察法 01 （後半のみ3,4限連続）', '', '木', '3', '01', 'n', 'n', 0),
(245, '1930004550', '行動観察法 02 （後半のみ3,4限連続）', '', '木', '3', '02', 'n', 'n', 0),
(246, '1930004580', '分子生物学・生化学実習 （3,4限連続）', '', '金', '3', '01', 'n', 'y', 0),
(247, '1930004600', '応用健康科学実習 （前半のみ3,4限連続）', '', '火', '3', '01', 'n', 'y', 0),
(248, '1930004610', '対人関係性支援研究法 01', '', '火', '3', '01', 'n', 'n', 0),
(249, '1930004610', '対人関係性支援研究法 02', '', '火', '5', '02', 'n', 'y', 0),
(250, '1930004610', 'ものづくり設計演習A', '', '木', '3', '01', 'n', 'n', 0),
(251, '1930004710', 'ケースフォーミュレーション 01', '', '木', '3', '01', 'n', 'n', 0),
(252, '1930004710', 'ケースフォーミュレーション 03', '', '水', '4', '03', 'n', 'y', 0),
(253, '1930004730', '臨床実践研究法 03', '', '木', '4', '03', 'n', 'y', 0),
(254, '1930004740', '実践心理学研究法 01 （3,4限連続）', '', '月', '3', '01', 'n', 'n', 0),
(255, '1930004750', '心理行動学研究法 01 （4,5限連続）', '', '金', '4', '01', 'n', 'y', 0),
(256, '1930004780', '教育工学研究法 01', '', '火', '3', '01', 'n', 'y', 0),
(257, '1930004780', '教育工学研究法 03', '', '月', '3', '03', 'n', 'y', 0),
(258, '1930004790', '情報科学研究法 01', '', '木', '3', '01', 'n', 'y', 0),
(259, '1930004790', '情報科学研究法 04', '', '金', '4', '04', 'n', 'n', 0),
(260, '1930004820', '地球生態系科学', '', '火', '3', '01', 'n', 'n', 0),
(261, '1930004840', '社会学', '', '金', '2', '01', 'n', 'y', 0),
(262, '1930004860', '文化人類学', '', '火', '2', '01', 'n', 'y', 0),
(264, '1930004870', '考古学', '', '月', '2', '01', 'n', 'n', 0),
(265, '1930004880', '建築都市デザイン論', '', '火', '2', '01', 'n', 'n', 0),
(266, '1930004900', '生理学', '', '月', '1', '01', 'n', 'y', 0),
(267, '1930004910', '解剖学 （前半のみ4,5限連続）', '', '水', '4', '01', 'n', 'y', 0),
(268, '1930004940', '医療福祉工学', '', '金', '2', '01', 'n', 'y', 0),
(269, '1930004950', '現代社会と福祉', '', '月', '2', '01', 'n', 'n', 0),
(270, '1930004970', '臨床心理学 01', '', '木', '1', '01', 'n', 'y', 0),
(271, '1930004970', '臨床心理学 02', '', '月', '1', '02', 'n', 'y', 0),
(272, '1930004990', '心理学概論', '', '月', '1', '01', 'n', 'n', 0),
(273, '1930005000', '人間工学', '', '火', '2', '01', 'n', 'y', 0),
(274, '1930005010', '人間計測・人間情報モデリング', '', '火', '2', '01', 'n', 'n', 0),
(275, '1930005040', 'メディアコミュニケーション学', '', '木', '1', '01', 'n', 'y', 0),
(276, '1930005060', '環境化学', '', '金', '3', '01', 'n', 'y', 0),
(277, '1930005075', '環境微生物学', '', '月', '2', '01', 'n', 'y', 0),
(278, '1930005080', '動物行動学', '', '木', '3', '01', 'n', 'y', 0),
(279, '1930005100', '環境管理計画学', '', '月', '4', '01', 'n', 'n', 0),
(280, '1930005110', '水域環境変遷学', '', '火', '2', '01', 'n', 'y', 0),
(281, '1930005140', 'ヒトと陸上生態系', '', '木', '1', '01', 'n', 'y', 0),
(282, '1930005150', '里山保全論', '', '金', '3', '01', 'n', 'y', 0),
(283, '1930005160', '熱帯林保全論', '', '夏季', '00', '01', 'n', 'y', 0),
(284, '1930005180', '植物生理生態学', '', '水', '2', '01', 'n', 'y', 0),
(285, '1930005190', '基礎地形学', '', '水', '5', '01', 'n', 'y', 0),
(286, '1930005200', '基礎気候学', '', '木', '3', '01', 'n', 'y', 0),
(287, '1930005240', '地域資源論', '', '火', '3', '01', 'n', 'y', 0),
(288, '1930005265', '現代社会理論', '', '火', '4', '01', 'n', 'y', 0),
(289, '1930005270', '階級・階層論', '', '木', '2', '01', 'n', 'y', 0),
(290, '1930005280', '社会開発論', '', '月', '2', '01', 'n', 'y', 0),
(291, '1930005300', '人口社会学', '', '火', '2', '01', 'n', 'y', 0),
(292, '1930005320', '環境社会学', '', '木', '2', '01', 'n', 'y', 0),
(293, '1930005340', '社会調査論', '', '水', '3', '01', 'n', 'n', 0),
(294, '1930005350', '政治学', '', '水', '1', '01', 'n', 'y', 0),
(295, '1930005355', '経済学', '', '火', '2', '01', 'n', 'y', 0),
(296, '1930005370', '人文地理学A', '', '金', '1', '01', 'n', 'y', 0),
(297, '1930005400', '史学方法論', '', '月', '1', '01', 'n', 'y', 0),
(298, '1930005410', '文化生態学', '', '月', '4', '01', 'n', 'y', 0),
(299, '1930005450', '生態人類学', '', '木', '4', '01', 'n', 'y', 0),
(300, '1930005470', 'フランス文化論', '', '火', '4', '01', 'n', 'y', 0),
(301, '1930005510', '日本民俗学', '', '水', '3', '01', 'n', 'y', 0),
(302, '1930005520', '環境史', '', '月', '3', '01', 'n', 'y', 0),
(303, '1930005550', '日本史A', '', '金', '4', '01', 'n', 'y', 0),
(304, '1930005570', '中国史', '', '月', '1', '01', 'n', 'y', 0),
(305, '1930005580', 'オリエント史', '', '金', '2', '01', 'n', 'y', 0),
(306, '1930005620', '発達心理学', '', '月', '2', '01', 'n', 'y', 0),
(307, '1930005650', '身体・環境論', '', '水', '1', '01', 'n', 'y', 0),
(308, '1930005670', '建築人間工学', '', '木', '2', '01', 'n', 'y', 0),
(309, '1930005700', 'インテリア環境論', '', '月', '2', '01', 'n', 'y', 0),
(310, '1930005710', '建築環境心理学', '', '月', '3', '01', 'n', 'n', 0),
(311, '1930005720', '社会心理学', '', '金', '1', '01', 'n', 'y', 0),
(312, '1930005750', '分子神経科学', '', '木', '3', '01', 'n', 'y', 0),
(313, '1930005760', '健康科学概論', '', '金', '3', '01', 'n', 'y', 0),
(314, '1930005780', '生化学', '', '木', '2', '01', 'n', 'y', 0),
(315, '1930005800', '環境生理学', '', '木', '1', '01', 'n', 'y', 0),
(316, '1930005820', '神経筋制御論', '', '火', '2', '01', 'n', 'y', 0),
(317, '1930005870', '免疫学', '', '夏季', '00', '01', 'n', 'y', 0),
(318, '1930005900', '栄養科学', '', '夏季', '00', '01', 'n', 'y', 0),
(319, '1930005940', '救急医学', '', '月', '3', '01', 'n', 'y', 0),
(320, '1930005970', '生活習慣病の人間科学', '', '木', '3', '01', 'n', 'y', 0),
(321, '1930006000', '労働安全衛生法', '', '月', '4', '01', 'n', 'y', 0),
(322, '1930006010', '労働法規', '', '木', '1', '01', 'n', 'y', 0),
(323, '1930006020', '労働衛生', '', '木', '2', '01', 'n', 'n', 0),
(324, '1930006030', '青年期の医学概論', '', '夏季', '00', '01', 'n', 'y', 0),
(325, '1930006040', '子どもと女性の医学概論', '', '水', '4', '01', 'n', 'y', 0),
(326, '1930006110', '健康福祉産業論', '', '木', '2', '01', 'n', 'y', 0),
(327, '1930006140', '生活支援工学', '', '火', '3', '01', 'n', 'y', 0),
(328, '1930006150', '先端医療工学', '', '夏季', '00', '01', 'n', 'y', 0),
(329, '1930006170', '社会福祉援助技術総論1', '', '木', '2', '01', 'n', 'y', 0),
(330, '1930006180', '社会福祉援助技術総論2', '', '木', '3', '01', 'n', 'y', 0),
(331, '1930006200', '社会保障論 1', '', '火', '3', '01', 'n', 'y', 0),
(332, '1930006220', '地域福祉論 1', '', '金', '3', '01', 'n', 'y', 0),
(333, '1930006250', '健康福祉指導法', '', '金', '1', '01', 'n', 'y', 0),
(334, '1930006260', '子ども家庭福祉論', '', '金', '3', '01', 'n', 'y', 0),
(335, '1930006280', '障害者福祉論', '', '月', '3', '01', 'n', 'n', 0),
(336, '1930006290', '公的扶助論', '', '夏季', '00', '01', 'n', 'y', 0),
(337, '1930006300', '介護学概論', '', '水', '2', '01', 'n', 'y', 0),
(338, '1930006315', 'ソーシャルワーク論 1', '', '水', '4', '01', 'n', 'y', 0),
(339, '1930006330', 'ソーシャルワーク論 3', '', '水', '1', '01', 'n', 'y', 0),
(340, '1930006390', '認知行動療法', '', '木', '2', '01', 'n', 'y', 0),
(341, '1930006400', '医療・産業カウンセリング', '', '木', '1', '01', 'n', 'y', 0),
(342, '1930006410', '統合心理療法', '', '木', '3', '01', 'n', 'y', 0),
(343, '1930006420', '心身医学', '', '木', '2', '01', 'n', 'y', 0),
(344, '1930006430', '健康心理学', '', '土', '2', '01', 'n', 'y', 0),
(345, '1930006440', '犯罪心理学', '', '夏季', '00', '01', 'n', 'y', 0),
(346, '1930006450', '高齢者臨床心理学', '', '夏季', '00', '01', 'n', 'y', 0),
(347, '1930006460', '認知心理学', '', '火', '2', '01', 'n', 'y', 0),
(348, '1930006490', '安全人間工学', '', '火', '3', '01', 'n', 'y', 0),
(349, '1930006500', '言語情報科学', '', '木', '3', '01', 'n', 'y', 0),
(350, '1930006510', 'デザイン心理学', '', '夏季', '00', '01', 'n', 'y', 0),
(351, '1930006520', '非言語行動論', '', '水', '1', '01', 'n', 'y', 0),
(352, '1930006550', '生態心理学', '', '火', '3', '01', 'n', 'y', 0),
(353, '1930006570', '特殊環境応答論', '', '火', '1', '01', 'n', 'y', 0),
(354, '1930006580', '感覚情報工学', '', '月', '2', '01', 'n', 'y', 0),
(355, '1930006590', '色彩情報論', '', '夏季', '00', '01', 'n', 'y', 0),
(356, '1930006610', 'マルチメディア', '', '木', '3', '01', 'n', 'n', 0),
(357, '1930006640', '学習環境デザイン', '', '火', '3', '01', 'n', 'y', 0),
(358, '1930006650', 'ヒューマン・コンピュータ・インタラクション', '', '火', '2', '01', 'n', 'y', 0),
(359, '1930006680', '生涯学習と成人教育学', '', '月', '4', '01', 'n', 'y', 0),
(360, '1930006700', '遠隔学習支援論', '', '夏季', '00', '01', 'n', 'y', 0),
(361, '1930006720', '心理教育学', '', '火', '2', '01', 'n', 'y', 0),
(362, '1930006730', 'The Developing Adult', '', '木', '1', '01', 'n', 'y', 0),
(363, '1930006740', 'Intercultural Communication', '', '木', '2', '01', 'n', 'y', 0),
(364, '1930006750', '教育メディア科学', '', '木', '3', '01', 'n', 'y', 0),
(365, '1930006780', '教育測定論', '', '火', '2', '01', 'n', 'y', 0),
(366, '1930006810', '教師学', '', '月', '1', '01', 'n', 'y', 0),
(367, '1930006820', '教育心理学の基礎', '', '夏季', '00', '01', 'n', 'y', 0),
(368, '1930006840', '英語圏文化概論', '', '金', '4', '01', 'n', 'n', 0),
(370, '1930006850', '身体コミュニケーション概論', '', '夏季', '00', '01', 'n', 'y', 0),
(371, '1930006860', 'Introduction to Sociolinguistics', '', '木', '3', '01', 'n', 'y', 0),
(372, '1930006880', 'コンピュータハードウェア', '', '夏季', '00', '01', 'n', 'y', 0),
(373, '1930006890', 'アルゴリズムとデータ構造', '', '夏季', '00', '01', 'n', 'y', 0),
(374, '1930006900', 'プログラミング入門（Java言語）01', '', '木', '4', '01', 'n', 'y', 0),
(375, '1930006905', 'プログラミング入門（C言語）', '', '火', '1', '01', 'n', 'n', 0),
(376, '1930006910', 'プログラミング入門（Perl言語）', '', '木', '2', '01', 'n', 'n', 0),
(377, '1930006930', 'プログラミング上級（Python言語）', '', '火', '3', '01', 'n', 'y', 0),
(378, '1930006950', 'ウェブデザイン入門', '', '夏季', '00', '01', 'n', 'y', 0),
(379, '1930006970', '情報通信ネットワーク', '', '水', '4', '01', 'n', 'n', 0),
(380, '1930004720', '行動臨床科学研究法 04', '', '木', '3', '04', 'n', 'y', 0),
(381, '1930004833', '基礎地理学', '', '金', '2', '01', 'n', 'y', 0),
(382, '1930006240', '子どもの健康福祉学', '', '金', '2', '01', 'n', 'y', 0),
(383, '1930001110', '英文学講読', '', '夏季', '00', '01', 'n', 'y', 0),
(384, '193000F240', '就労支援及び更生保護', '', '夏季', '00', '01', 'n', 'y', 0);

-- --------------------------------------------------------

--
-- Table structure for table `tm_member`
--

CREATE TABLE IF NOT EXISTS `tm_member` (
`id` int(11) NOT NULL COMMENT '会員ID',
  `e-mail` varchar(128) NOT NULL COMMENT 'メールアドレス',
  `nick_name` varchar(128) NOT NULL COMMENT 'ニックネーム',
  `name` varchar(128) NOT NULL COMMENT '本名',
  `birth_day` date DEFAULT '1990-01-01' COMMENT '誕生日',
  `entrance_year` varchar(4) NOT NULL DEFAULT '2014' COMMENT '入学年度'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='会員テーブル' AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Table structure for table `tm_review`
--

CREATE TABLE IF NOT EXISTS `tm_review` (
`id` int(11) NOT NULL COMMENT 'レビューID',
  `class_id` int(11) NOT NULL DEFAULT '0' COMMENT '授業ID',
  `reviewer_id` int(11) NOT NULL DEFAULT '0' COMMENT '投稿者ID',
  `grade` varchar(1) NOT NULL DEFAULT '1' COMMENT '受講学年',
  `year` varchar(4) NOT NULL DEFAULT '2000' COMMENT '受講年度',
  `review_comment` text NOT NULL COMMENT 'レビューコメント',
  `stars` varchar(1) NOT NULL DEFAULT '0' COMMENT '星',
  `diff_teacher` varchar(1) NOT NULL DEFAULT '0' COMMENT '講師が異なるかどうか',
  `created_at` timestamp NOT NULL DEFAULT '2014-12-31 15:00:00' COMMENT '登録日',
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' ON UPDATE CURRENT_TIMESTAMP COMMENT 'レビュー修正日時'
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='ユーザーレビューテーブル' AUTO_INCREMENT=17 ;

--
-- Dumping data for table `tm_review`
--

INSERT INTO `tm_review` (`id`, `class_id`, `reviewer_id`, `grade`, `year`, `review_comment`, `stars`, `diff_teacher`, `created_at`, `updated_at`) VALUES
(1, 4, 0, '3', '2015', '教師がおもろかった', '5', '0', '2015-05-19 18:50:37', '2015-05-20 04:45:31'),
(2, 4, 0, '5', '2014', '菊池先生がおもろい', '5', '0', '2015-05-20 02:55:28', '2015-05-20 04:45:55'),
(3, 4, 0, '3', '2011', '何を"スタディ"してるのか全くわからん', '1', '0', '2015-05-20 03:36:50', '2015-05-20 04:46:27'),
(11, 353, 0, '1', '2011', 'ほどほどよかった。', '1', '0', '2015-05-20 06:28:19', '2015-05-20 06:28:19'),
(12, 329, 0, '4', '2012', '難しい', '4', '0', '2015-05-20 06:44:49', '2015-05-20 06:44:49'),
(15, 46, 0, '1', '2011', 'ああああ', '1', '0', '2015-05-21 03:51:11', '2015-05-21 03:51:11');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE IF NOT EXISTS `users` (
`id` int(10) unsigned NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(60) COLLATE utf8_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=1 ;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
 ADD KEY `password_resets_email_index` (`email`), ADD KEY `password_resets_token_index` (`token`);

--
-- Indexes for table `queries`
--
ALTER TABLE `queries`
 ADD PRIMARY KEY (`id`), ADD UNIQUE KEY `word` (`word`);

--
-- Indexes for table `sessions`
--
ALTER TABLE `sessions`
 ADD UNIQUE KEY `sessions_id_unique` (`id`);

--
-- Indexes for table `tm_classes`
--
ALTER TABLE `tm_classes`
 ADD PRIMARY KEY (`id`), ADD UNIQUE KEY `code` (`id`);

--
-- Indexes for table `tm_member`
--
ALTER TABLE `tm_member`
 ADD PRIMARY KEY (`id`), ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `tm_review`
--
ALTER TABLE `tm_review`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
 ADD PRIMARY KEY (`id`), ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `queries`
--
ALTER TABLE `queries`
MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=18;
--
-- AUTO_INCREMENT for table `tm_classes`
--
ALTER TABLE `tm_classes`
MODIFY `id` int(20) NOT NULL AUTO_INCREMENT COMMENT '授業ID',AUTO_INCREMENT=385;
--
-- AUTO_INCREMENT for table `tm_member`
--
ALTER TABLE `tm_member`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '会員ID';
--
-- AUTO_INCREMENT for table `tm_review`
--
ALTER TABLE `tm_review`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'レビューID',AUTO_INCREMENT=17;
--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
